In [46]:
import pandas as pd 
import pymysql
import getpass
from sqlalchemy import create_engine

In [47]:
password= getpass.getpass()

In [48]:
db = "vanguard"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+db
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/vanguard)

In [49]:
url2='https://raw.githubusercontent.com/data-bootcamp-v4/lessons/refs/heads/main/5_6_eda_inf_stats_tableau/project/files_for_project/df_final_experiment_clients.txt'
df_variation= pd.read_csv(url2)

In [50]:
from sqlalchemy import text
import pandas as pd

# Ensure 'engine' is defined before this block
with engine.connect() as connection:
    txt = '''
        SELECT *
        FROM customer_data_cleaned
    '''
    
    # Prepare the SQL query
    query = text(txt)
    
    # Execute the query and fetch all results
    result = connection.execute(query)
    
    # Convert to DataFrame using column names from result metadata
    df_customer = pd.DataFrame(result.fetchall(), columns=result.keys())

In [51]:
from sqlalchemy import text


with engine.connect()as connection:
    txt = '''
            SELECT 
                date_time,
                client_id,
                visitor_id,
                visit_id,
                CASE 
                    WHEN process_step = 'start' THEN 0
                    WHEN process_step = 'step_1' THEN 1
                    WHEN process_step = 'step_2' THEN 2
                    WHEN process_step = 'step_3' THEN 3
                    WHEN process_step = 'confirm' THEN 4
                    ELSE NULL
                END AS process_id,
                process_step
            FROM digital_footprint;

        '''
        
        # Prepares the SQL query for execution using SQLAlchemy's `text()` method
    query = text(txt)
        
    # Executes the query on the connected database
    result = connection.execute(query)
        
    # Converts the result to a pandas DataFrame with appropriate column names
    df_digital_footprint= pd.DataFrame(result.all())

In [52]:
df_digital_footprint

,date_time,client_id,visitor_id,visit_id,process_id,process_step
0,2017-04-17 15:27:07,9988021,580560515_7732621733,781255054_21935453173_531117,3,step_3
1,2017-04-17 15:26:51,9988021,580560515_7732621733,781255054_21935453173_531117,2,step_2
2,2017-04-17 15:19:22,9988021,580560515_7732621733,781255054_21935453173_531117,3,step_3
3,2017-04-17 15:19:13,9988021,580560515_7732621733,781255054_21935453173_531117,2,step_2
4,2017-04-17 15:18:04,9988021,580560515_7732621733,781255054_21935453173_531117,3,step_3
...,...,...,...,...,...,...
744636,2017-05-24 18:46:10,9668240,388766751_9038881013,922267647_3096648104_968866,0,start
744637,2017-05-24 18:45:29,9668240,388766751_9038881013,922267647_3096648104_968866,0,start
744638,2017-05-24 18:44:51,9668240,388766751_9038881013,922267647_3096648104_968866,1,step_1
744639,2017-05-24 18:44:34,9668240,388766751_9038881013,922267647_3096648104_968866,0,start
744640,2017-06-03 12:17:09,674799,947159805_81558194550,86152093_47511127657_716022,0,start

In [53]:
df_variation

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [54]:
df_digital_footprint.set_index('client_id',inplace= True)
df_variation.set_index('client_id',inplace=True)

In [55]:
#df= pd.merge(df_digital_footprint,df_variation,on='client_id',how='inner')

In [56]:
df_client_exp= df_digital_footprint.join(df_variation,how='inner')

In [57]:
df_client_exp

,date_time,visitor_id,visit_id,process_id,process_step,Variation
client_id,,,,,,
9988021,2017-04-17 15:27:07,580560515_7732621733,781255054_21935453173_531117,3,step_3,Test
9988021,2017-04-17 15:26:51,580560515_7732621733,781255054_21935453173_531117,2,step_2,Test
9988021,2017-04-17 15:19:22,580560515_7732621733,781255054_21935453173_531117,3,step_3,Test
9988021,2017-04-17 15:19:13,580560515_7732621733,781255054_21935453173_531117,2,step_2,Test
9988021,2017-04-17 15:18:04,580560515_7732621733,781255054_21935453173_531117,3,step_3,Test
...,...,...,...,...,...,...
9895983,2017-06-15 19:52:09,473024645_56027518531,498981662_93503779869_272484,3,step_3,NaN
9895983,2017-06-15 19:50:37,473024645_56027518531,498981662_93503779869_272484,2,step_2,NaN
9895983,2017-06-15 19:50:05,473024645_56027518531,498981662_93503779869_272484,1,step_1,NaN
9895983,2017-06-15 19:50:00,473024645_56027518531,498981662_93503779869_272484,0,start,NaN
9895983,2017-06-15 19:44:05,473024645_56027518531,498981662_93503779869_272484,0,start,NaN

In [58]:
df_client_exp['completed'] = df_client_exp.apply(
    lambda row: 1 if str(row['process_step']).strip().lower() == 'confirm' else 0,
    axis=1
)

In [59]:
df_client_exp['completed'] = df_client_exp['process_step'].apply(
    lambda x: 1 if str(x).strip().lower() == 'confirm' else 0
)

grouped_df = df_client_exp.groupby(['client_id','visit_id', 'date_time'])[['completed']].sum().reset_index()

df_merged = df_client_exp.merge(grouped_df, on=['client_id','visit_id', 'date_time'], suffixes=('', '_sum'))

df_merged = df_merged.sort_values(by=['client_id','visit_id', 'date_time'])

In [60]:
df_merged.head()

,client_id,date_time,visitor_id,visit_id,process_id,process_step,Variation,completed,completed_sum
279371,169,2017-04-12 20:19:36,201385055_71273495308,749567106_99161211863_557568,0,start,NaN,0,0
279370,169,2017-04-12 20:19:45,201385055_71273495308,749567106_99161211863_557568,1,step_1,NaN,0,0
279369,169,2017-04-12 20:20:31,201385055_71273495308,749567106_99161211863_557568,2,step_2,NaN,0,0
279368,169,2017-04-12 20:22:05,201385055_71273495308,749567106_99161211863_557568,3,step_3,NaN,0,0
279367,169,2017-04-12 20:23:09,201385055_71273495308,749567106_99161211863_557568,4,confirm,NaN,1,1

In [61]:
df_merged.shape

(443897, 9)

In [62]:
df_merged['date_time']=pd.to_datetime(df_merged['date_time'])

In [63]:

# Sort by visit_id and date_time
df_merged = df_merged.sort_values(by=['visit_id', 'date_time'])


# Calculate time spent on each process step in seconds
df_merged['time_spent'] = (df_merged.groupby('visit_id')['date_time'].diff().fillna(pd.Timedelta(seconds=0)).dt.total_seconds())

In [64]:
df_merged

,client_id,date_time,visitor_id,visit_id,process_id,process_step,Variation,completed,completed_sum,time_spent
106314,3561384,2017-04-26 13:22:17,451664975_1722933822,100012776_37918976071_457913,4,confirm,Test,1,1,0.0
106313,3561384,2017-04-26 13:23:09,451664975_1722933822,100012776_37918976071_457913,4,confirm,Test,1,1,52.0
235345,7338123,2017-04-09 16:20:56,612065484_94198474375,100019538_17884295066_43909,0,start,Test,0,0,0.0
235344,7338123,2017-04-09 16:21:12,612065484_94198474375,100019538_17884295066_43909,1,step_1,Test,0,0,16.0
235343,7338123,2017-04-09 16:21:21,612065484_94198474375,100019538_17884295066_43909,2,step_2,Test,0,0,9.0
...,...,...,...,...,...,...,...,...,...,...
95172,6627522,2017-04-21 23:49:22,730634087_44272418812,999988789_76411676596_272843,1,step_1,Test,0,0,11.0
95171,6627522,2017-04-21 23:50:16,730634087_44272418812,999988789_76411676596_272843,2,step_2,Test,0,0,54.0
95170,6627522,2017-04-21 23:51:00,730634087_44272418812,999988789_76411676596_272843,1,step_1,Test,0,0,44.0
95169,6627522,2017-04-21 23:51:09,730634087_44272418812,999988789_76411676596_272843,0,start,Test,0,0,9.0
315943,3761538,2017-04-08 13:21:03,522028589_37033306085,999991142_15352368745_399725,0,start,NaN,0,0,0.0

In [65]:

df_merged = df_merged.sort_values(by=['visit_id', 'date_time'])

# Define the error condition using if-else logic
def detect_error(current, previous):
    if pd.isna(previous):
        return 0
    elif current < previous:
        return 1
    else:
        return 0

# Compute the previous process_id within each visit
df_merged['prev_process_id'] = df_merged.groupby('visit_id')['process_id'].shift(1)

# Apply the function row-wise
df_merged['error'] = df_merged.apply(lambda row: detect_error(row['process_id'], row['prev_process_id']), axis=1).shift(-1)

# Drop the prev_process_id column
df_merged = df_merged.drop(columns=['prev_process_id'])

In [66]:
df_merged.head()

,client_id,date_time,visitor_id,visit_id,process_id,process_step,Variation,completed,completed_sum,time_spent,error
106314,3561384,2017-04-26 13:22:17,451664975_1722933822,100012776_37918976071_457913,4,confirm,Test,1,1,0.0,0.0
106313,3561384,2017-04-26 13:23:09,451664975_1722933822,100012776_37918976071_457913,4,confirm,Test,1,1,52.0,0.0
235345,7338123,2017-04-09 16:20:56,612065484_94198474375,100019538_17884295066_43909,0,start,Test,0,0,0.0,0.0
235344,7338123,2017-04-09 16:21:12,612065484_94198474375,100019538_17884295066_43909,1,step_1,Test,0,0,16.0,0.0
235343,7338123,2017-04-09 16:21:21,612065484_94198474375,100019538_17884295066_43909,2,step_2,Test,0,0,9.0,1.0

In [67]:
# Completion = user has at least one 'confirm' step
completion = df_merged[df_merged['process_step'] == 'confirm'][['client_id', 'Variation']].drop_duplicates()

# Count unique users per variation
users_by_group = df_merged[['client_id', 'Variation']].drop_duplicates().groupby('Variation').count()
completed_by_group = completion.groupby('Variation').count()

# Completion rate
completion_rate = (completed_by_group / users_by_group) * 100
completion_rate.columns = ['Completion Rate (%)']
print(completion_rate)

           Completion Rate (%)
Variation
Control              65.587285
Test                 69.293236

In [68]:
# Sort for time differences
df_sorted = df_merged.sort_values(by=['client_id', 'visit_id', 'date_time'])

# Calculate time difference between steps
df_sorted['time_diff'] = df_sorted.groupby(['client_id', 'visit_id'])['date_time'].diff().dt.total_seconds()

# Average time per step
avg_time_step = df_sorted.groupby('process_step')['time_diff'].mean().round(2)
print(avg_time_step)

process_step
confirm    129.43
start      161.80
step_1      40.44
step_2      43.76
step_3      96.30
Name: time_diff, dtype: float64

In [69]:
# Error = step number goes backward
df_sorted['step_num'] = df_sorted['process_step'].str.extract('(\d+)').fillna(0).astype(int)
df_sorted['step_diff'] = df_sorted.groupby(['client_id', 'visit_id'])['step_num'].diff()

# Count errors
errors = df_sorted[df_sorted['step_diff'] < 0]
error_rate = errors.groupby('Variation')['client_id'].nunique() / df_merged.groupby('Variation')['client_id'].nunique()
print("Error Rate by Variation:")
print(error_rate)

<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
C:\Users\samya\AppData\Local\Temp\ipykernel_14780\4251029529.py:2: SyntaxWarning: invalid escape sequence '\d'
  df_sorted['step_num'] = df_sorted['process_step'].str.extract('(\d+)').fillna(0).astype(int)

Error Rate by Variation:
Variation
Control    0.739716
Test       0.819193
Name: client_id, dtype: float64

In [70]:
import pandas as pd
from statsmodels.stats.proportion import proportions_ztest
# Example: df_sorted is your cleaned DataFrame
# df_sorted = pd.read_csv('cleaned_experiment_data.csv')
# Calculate completions and total users by group
completed_by_group = df_merged[['client_id', 'Variation']].drop_duplicates().groupby('Variation').sum()
users_by_group = completion.groupby('Variation').nunique()

# Prepare counts for hypothesis test
complete_counts = completed_by_group.client_id.values
total_counts = users_by_group.client_id.values
# Run the z-test
stat, pval = proportions_ztest(count=complete_counts, nobs=total_counts, alternative='larger')
# Output results
print(stat,pval)
#print(f"Z-Statistic: {stat:.3f}, P-value: {pval:.4f}")
if pval < 0.05:
    print("Statistically significant difference. Reject the null hypothesis.")
else:
    print(" Not statistically significant. Cannot reject the null.")

nan nan
 Not statistically significant. Cannot reject the null.

c:\Users\samya\PyCharmProject\Vanguard_customer_experience_EDA\.venv\Lib\site-packages\statsmodels\stats\proportion.py:1024: RuntimeWarning: invalid value encountered in sqrt
  std_diff = np.sqrt(var_)

In [71]:
complete_counts = completed_by_group.values
total_counts = users_by_group.values
complete_counts

array([[117988588801],
       [134823453745]])

In [72]:

completed = df_merged[df_merged['completed'] == 1]

# Step 2: Count completions by group
completed_by_group = df_merged.groupby('Variation')['completed'].sum()

# Step 3: Count total users by group
users_by_group = df_merged.groupby('Variation')['client_id'].sum()

# Step 4: Ensure only two groups are present
if len(completed_by_group) != 2 or len(users_by_group) != 2:
    raise ValueError("The data must contain exactly two groups: 'Test' and 'Control'.")

# Step 5: Prepare counts for hypothesis test
complete_counts = completed_by_group.values
total_counts = users_by_group.values

# Step 6: Run the z-test
stat, pval = proportions_ztest(count=complete_counts, nobs=total_counts, alternative='larger')

# Step 7: Output results
print(f"Z-Statistic: {stat:.3f}, P-value: {pval:.4f}")
if pval < 0.05:
    print("Statistically significant difference. Reject the null hypothesis.")
else:
    print("Not statistically significant. Cannot reject the null.")

Z-Statistic: -16.519, P-value: 1.0000
Not statistically significant. Cannot reject the null.

In [73]:
rate_diff = (completion_rate.loc['Test'].values[0] - completion_rate.loc['Control'].values[0])

print(f"Observed Completion Rate Increase: {rate_diff:.2f}%")
if rate_diff >= 5:
    print("Improvement exceeds the 5% threshold. Cost-effective.")
else:
    print("Improvement does NOT exceed the 5% threshold.")

Observed Completion Rate Increase: 3.71%
Improvement does NOT exceed the 5% threshold.

In [74]:
cust_merge_df= pd.merge(df_customer,df_variation, on='client_id',how='left')

In [75]:
cust_merge_df

,client_id,clnt_age,gender,clnt_tenure_yr,clnt_tenure_mnth,num_accts,calls_6_mnth,logons_6_mnth,balance,Variation
0,169,47.5,M,21.0,262.0,2.0,4.0,4.0,501570.72,NaN
1,555,29.5,U,3.0,46.0,2.0,2.0,6.0,25454.66,Test
2,647,57.5,M,12.0,151.0,2.0,0.0,4.0,30525.80,Test
3,722,59.5,F,11.0,143.0,2.0,1.0,1.0,22466.17,NaN
4,934,51.0,F,9.0,109.0,2.0,0.0,3.0,32522.88,Test
...,...,...,...,...,...,...,...,...,...,...
70604,9999400,28.5,U,7.0,86.0,2.0,0.0,3.0,51787.04,Test
70605,9999626,35.0,M,9.0,113.0,2.0,6.0,9.0,36642.88,Test
70606,9999729,31.0,F,10.0,124.0,3.0,6.0,9.0,107059.74,Test
70607,9999832,49.0,F,23.0,281.0,2.0,1.0,4.0,431887.61,Test
70608,9999839,28.5,F,13.0,160.0,2.0,3.0,3.0,67425.35,NaN

In [76]:
columns_to_convert = ['clnt_tenure_yr', 'clnt_tenure_mnth', 'num_accts', 'calls_6_mnth', 'logons_6_mnth']
cust_merge_df[columns_to_convert] = cust_merge_df[columns_to_convert].fillna(0).astype(int)

In [77]:
cust_merge_df.head()

,client_id,clnt_age,gender,clnt_tenure_yr,clnt_tenure_mnth,num_accts,calls_6_mnth,logons_6_mnth,balance,Variation
0,169,47.5,M,21,262,2,4,4,501570.72,NaN
1,555,29.5,U,3,46,2,2,6,25454.66,Test
2,647,57.5,M,12,151,2,0,4,30525.80,Test
3,722,59.5,F,11,143,2,1,1,22466.17,NaN
4,934,51.0,F,9,109,2,0,3,32522.88,Test

In [78]:
from scipy.stats import ttest_ind

# Clean age data
cust_merge_df['clnt_age'] = pd.to_numeric(cust_merge_df['clnt_age'], errors='coerce')
test_age = cust_merge_df[cust_merge_df['Variation'] == 'Test']['clnt_age'].dropna()
control_age = cust_merge_df[cust_merge_df['Variation'] == 'Control']['clnt_age'].dropna()

# T-test
stat, pval = ttest_ind(test_age, control_age, equal_var=False)
print(f"T-Statistic: {stat:.2f}, P-value: {pval:.4f}")
if pval < 0.05:
    print("Statistically significant difference in age between groups.")
else:
    print("No significant difference in age.")

T-Statistic: -2.42, P-value: 0.0157
Statistically significant difference in age between groups.

In [79]:
# Clean tenure
cust_merge_df['clnt_tenure_mnth'] = pd.to_numeric(cust_merge_df['clnt_tenure_mnth'], errors='coerce')

test_tenure = cust_merge_df[cust_merge_df['Variation'] == 'Test']['clnt_tenure_mnth'].dropna()
control_tenure = cust_merge_df[cust_merge_df['Variation'] == 'Control']['clnt_tenure_mnth'].dropna()

# T-test
stat, pval = ttest_ind(test_tenure, control_tenure, equal_var=False)
print(f"T-Statistic: {stat:.2f}, P-value: {pval:.4f}")
if pval < 0.05:
    print("Statistically significant difference in tenure.")
else:
    print("No significant difference in tenure.")

T-Statistic: -1.66, P-value: 0.0969
No significant difference in tenure.

In [80]:
from scipy.stats import chi2_contingency

# Gender counts by group
gender_table = pd.crosstab(cust_merge_df['Variation'], cust_merge_df['gender'])

# Chi-square test
chi2, pval, dof, expected = chi2_contingency(gender_table)
print(f"Chi2 Statistic: {chi2:.2f}, P-value: {pval:.4f}")
if pval < 0.05:
    print("Gender distribution differs significantly between groups.")
else:
    print("No significant difference in gender distribution.")

Chi2 Statistic: 3.74, P-value: 0.4422
No significant difference in gender distribution.

In [81]:
cust_merge_df

,client_id,clnt_age,gender,clnt_tenure_yr,clnt_tenure_mnth,num_accts,calls_6_mnth,logons_6_mnth,balance,Variation
0,169,47.5,M,21,262,2,4,4,501570.72,NaN
1,555,29.5,U,3,46,2,2,6,25454.66,Test
2,647,57.5,M,12,151,2,0,4,30525.80,Test
3,722,59.5,F,11,143,2,1,1,22466.17,NaN
4,934,51.0,F,9,109,2,0,3,32522.88,Test
...,...,...,...,...,...,...,...,...,...,...
70604,9999400,28.5,U,7,86,2,0,3,51787.04,Test
70605,9999626,35.0,M,9,113,2,6,9,36642.88,Test
70606,9999729,31.0,F,10,124,3,6,9,107059.74,Test
70607,9999832,49.0,F,23,281,2,1,4,431887.61,Test
70608,9999839,28.5,F,13,160,2,3,3,67425.35,NaN